logs/benchmark_20250706_231741/h2_100ms_1pct.log
=== HTTP/2 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-06 23:18:10
Delay: 100ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 80b0: root refcnt 9 limit 1000 delay 100ms loss 1%

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 50 total requests
spawning thread #1: 5 total client(s). 50 total requests
spawning thread #2: 5 total client(s). 50 total requests
spawning thread #3: 5 total client(s). 50 total requests
spawning thread #4: 5 total client(s). 50 total requests
spawning thread #5: 5 total client(s). 50 total requests
spawning thread #6: 5 total client(s). 50 total requests
spawning thread #7: 5 total client(s). 50 total requests
spawning thread #8: 5 total client(s). 50 total requests
spawning thread #9: 5 total client(s). 50 total requests
spawning thread #10: 5 total client(s). 50 total requests
spawning thread #11: 5 total client(s). 50 total requests
spawning thread #12: 5 total client(s). 50 total requests
spawning thread #13: 5 total client(s). 50 total requests
spawning thread #14: 5 total client(s). 50 total requests
spawning thread #15: 5 total client(s). 50 total requests
spawning thread #16: 5 total client(s). 50 total requests
spawning thread #17: 5 total client(s). 50 total requests
spawning thread #18: 5 total client(s). 50 total requests
spawning thread #19: 5 total client(s). 50 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 101.63ms, 9839.23 req/s, 2.90MB/s
requests: 1000 total, 1000 started, 1000 done, 1000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 301.34KB (308576) total, 207.97KB (212962) headers (space savings 27.81%), 58.59KB (60000) data
                     min         max         mean         sd        +/- sd
time for request:     8.06ms     48.99ms     25.69ms     11.33ms    61.10%
time for connect:     4.43ms     85.49ms     40.58ms     19.83ms    60.00%
time to 1st byte:    24.74ms     99.79ms     66.23ms     24.73ms    61.00%
req/s           :     100.12      401.56      188.93      106.80    76.00%
Waiting 2s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 450 total requests
spawning thread #1: 5 total client(s). 450 total requests
spawning thread #2: 5 total client(s). 450 total requests
spawning thread #3: 5 total client(s). 450 total requests
spawning thread #4: 5 total client(s). 450 total requests
spawning thread #5: 5 total client(s). 450 total requests
spawning thread #6: 5 total client(s). 450 total requests
spawning thread #7: 5 total client(s). 450 total requests
spawning thread #8: 5 total client(s). 450 total requests
spawning thread #9: 5 total client(s). 450 total requests
spawning thread #10: 5 total client(s). 450 total requests
spawning thread #11: 5 total client(s). 450 total requests
spawning thread #12: 5 total client(s). 450 total requests
spawning thread #13: 5 total client(s). 450 total requests
spawning thread #14: 5 total client(s). 450 total requests
spawning thread #15: 5 total client(s). 450 total requests
spawning thread #16: 5 total client(s). 450 total requests
spawning thread #17: 5 total client(s). 450 total requests
spawning thread #18: 5 total client(s). 450 total requests
spawning thread #19: 5 total client(s). 450 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 666.15ms, 13510.43 req/s, 3.92MB/s
requests: 9000 total, 9000 started, 9000 done, 9000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 9000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 2.61MB (2740360) total, 1.83MB (1916499) headers (space savings 27.82%), 527.34KB (540000) data
                     min         max         mean         sd        +/- sd
time for request:    37.28ms    592.21ms    278.30ms    161.71ms    55.47%
time for connect:     3.49ms    118.51ms     64.50ms     31.72ms    60.00%
time to 1st byte:    44.53ms    589.22ms    294.24ms    169.31ms    55.00%
req/s           :     135.52      195.78      155.32       22.65    70.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/2
Fair Comparison: Enabled
Warmup Requests: 1000
Measurement Requests: 9000
End Time: 2025-07-06 23:18:13
CSV Log: /logs/benchmark_20250706_231741/h2_100ms_1pct.csv